# Set to series and DataFrame

In [17]:
import pandas as pd

In [18]:
s1={1,2,3,4,5,6,7,8,9}

In [19]:
s1

{1, 2, 3, 4, 5, 6, 7, 8, 9}

In [20]:
type(s1)

set

In [21]:
s=pd.Series(list(s1))

In [22]:
s

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [23]:
df=pd.DataFrame(s1,columns=['set_value'])

In [24]:
df

   set_value
0          1
1          2
2          3
3          4
4          5
5          6
6          7
7          8
8          9

# Tupple ot Dataframe

In [26]:
t=(1,2,3,56,8,4,85)
s=pd.Series(t)
s

0     1
1     2
2     3
3    56
4     8
5     4
6    85
dtype: int64

In [27]:
df=pd.DataFrame(t)
df

    0
0   1
1   2
2   3
3  56
4   8
5   4
6  85

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       7 non-null      int64
dtypes: int64(1)
memory usage: 188.0 bytes